; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared5 - mode
	thermograph2 - mode
	spectrograph0 - mode
	thermograph4 - mode
	image1 - mode
	spectrograph3 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star7 - direction
	Star2 - direction
	Star5 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph4)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared5)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star8 infrared5)
	(have_image Star8 image1)
	(have_image Star9 thermograph4)
	(have_image Star10 thermograph2)
	(have_image Star10 image1)
	(have_image Phenomenon11 thermograph4)
	(have_image Star12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Star13 thermograph4)
	(have_image Star14 thermograph2)
	(have_image Star14 image1)
	(have_image Planet15 infrared5)
	(have_image Planet15 image1)
))

)

; plan
1. (turn_to satellite0 star5 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star5)
   goals met: 0 of 14
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 14
4. (turn_to satellite0 star13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star13)
   goals met: 0 of 14
5. (take_image satellite0 star13 instrument1 thermograph4)
   added: (have_image star13 thermograph4)
   goals met: 1 of 14
6. (take_image satellite0 star13 instrument1 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 2 of 14
7. (turn_to satellite0 star10 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star10)
   goals met: 2 of 14
8. (take_image satellite0 star10 instrument1 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 3 of 14
9. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 4 of 14
10. (turn_to satellite0 planet15 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet15)
   goals met: 4 of 14
11. (take_image satellite0 planet15 instrument1 image1)
   added: (have_image planet15 image1)
   goals met: 5 of 14
12. (turn_to satellite0 phenomenon11 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 14
13. (take_image satellite0 phenomenon11 instrument1 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 6 of 14
14. (turn_to satellite0 star12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star12)
   goals met: 6 of 14
15. (take_image satellite0 star12 instrument1 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 7 of 14
16. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 7 of 14
17. (take_image satellite0 star14 instrument1 image1)
   added: (have_image star14 image1)
   goals met: 8 of 14
18. (take_image satellite0 star14 instrument1 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 9 of 14
19. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 9 of 14
20. (take_image satellite0 star8 instrument1 image1)
   added: (have_image star8 image1)
   goals met: 10 of 14
21. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 10 of 14
22. (take_image satellite0 star9 instrument1 thermograph4)
   added: (have_image star9 thermograph4)
   goals met: 11 of 14
23. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 11 of 14
24. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 11 of 14
25. (turn_to satellite0 star2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star2)
   goals met: 11 of 14
26. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 11 of 14
27. (turn_to satellite0 planet15 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet15)
   goals met: 11 of 14
28. (take_image satellite0 planet15 instrument0 infrared5)
   added: (have_image planet15 infrared5)
   goals met: 12 of 14
29. (turn_to satellite0 star8 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star8)
   goals met: 12 of 14
30. (take_image satellite0 star8 instrument0 infrared5)
   added: (have_image star8 infrared5)
   goals met: 13 of 14
31. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 14 of 14
